In [21]:
from sqlalchemy import create_engine
import pandas as pd
import numpy as np

In [2]:
engine  = create_engine(f"postgresql://postgres:Abdulaziz1993@localhost:5432/dvdrental")

In [3]:
def getSqlQuery(query):
    return pd.read_sql_query(query, engine)

In [4]:
# getting all sql tables
actor = getSqlQuery('SELECT * FROM actor;')
address = getSqlQuery('SELECT * FROM address;').drop('address2', axis=1)
category = getSqlQuery('SELECT * FROM category;')
city = getSqlQuery('SELECT * FROM city;')
country = getSqlQuery('SELECT * FROM country;')
customer = getSqlQuery('SELECT * FROM customer;')
film = getSqlQuery('SELECT * FROM film;').drop('special_features', axis=1)
film_actor = getSqlQuery('SELECT * FROM film_actor;')
film_category = getSqlQuery('SELECT * FROM film_category;')
inventory = getSqlQuery('SELECT * FROM inventory;')
language = getSqlQuery('SELECT * FROM language;')
payment = getSqlQuery('SELECT * FROM payment;')
rental = getSqlQuery('SELECT * FROM rental;')
staff = getSqlQuery('SELECT * FROM staff;')
store = getSqlQuery('SELECT * FROM store;')
## This code will do the exact same thing:

# tables = pd.read_sql_query("""SELECT table_name FROM INFORMATION_SCHEMA.TABLES
# WHERE is_insertable_into = 'YES' AND table_schema = 'public';""", engine)['table_name']

# for table in tables.values:
    # exec(f"{table} = getSqlQuery(f'SELECT * FROM {table}')")
# =============================================================

# tables = pd.read_sql_query("""SELECT table_name FROM INFORMATION_SCHEMA.TABLES
# WHERE is_insertable_into = 'YES' AND table_schema = 'public';""", engine)['table_name']

## or as a dictionary:
#dictOfTables = {}
#for table in tables.values:
    #dictOfTables[table] = getSqlQuery(f'SELECT * FROM {table}')

### Note: This database has a flaw, because rental table or payment table one of them should have had a film_id that was rented, now fact table is hard to be created

### but we can only get how much each film made based on the link between film -> inventory -> rental -> payment

In [5]:
# creating film_dim
film_dim = pd.merge(film, film_category, on='film_id', how='left', suffixes=('_film', '_filmCategory')).merge(category, on='category_id', how='left').merge(language, on='language_id', how='left', suffixes=('_category','_language')).merge(film_actor, on='film_id', how='left').merge(actor, on='actor_id', how='left', suffixes=('_filmActor','_actor'))

In [6]:
film_dim.shape

(5465, 23)

In [7]:
# creating address_dim
address_dim = pd.merge(address, city, on='city_id', how='left').merge(country, on='country_id', how='left')
address_dim.rename(columns={'last_update_x': 'last_update_address', 'last_update_y': 'last_update_city', 'last_update': 'last_update_country'}, inplace=True)

In [8]:
address_dim.shape

(603, 12)

In [9]:
# creating rental_dim
paymentsUniqueColumns = payment.columns.difference(rental.columns[rental.columns != 'rental_id'])
rental_dim = pd.merge(rental, payment.loc[:, paymentsUniqueColumns], on='rental_id', how='left')

In [10]:
rental_dim.shape

(16048, 10)

In [11]:
# creating inventory_dim
inventory_dim = pd.merge(inventory, store, on='store_id', how='left', suffixes=('_inventory', '_store'))

In [12]:
inventory_dim.shape

(4581, 7)

In [13]:
# create customer_dim
customer_dim = customer

In [14]:
customer_dim.shape

(599, 10)

In [15]:
# create staff_dim
staff_dim = staff

In [16]:
rentalColumns = rental.columns[~rental.columns.isin(['customer_id', 'staff_id'])]

In [17]:
# creating fact_table
fact_table = pd.merge(payment, rental[rentalColumns], on='rental_id', how='left').merge(customer, on='customer_id', how='left', suffixes=('', '_customer')).merge(address, on='address_id').merge(store['store_id'], on='store_id').merge(inventory, on='inventory_id', how='left').merge(film, on='film_id', how='left')[['rental_id', 'customer_id', 'staff_id', 'film_id', 'inventory_id', 'address_id', 'rental_id','store_id_x', 'amount']]

/var/folders/gl/qj0nq8nj63b8cmgp8whx5lrw0000gn/T/ipykernel_2700/4012121118.py:2: FutureWarning: Passing 'suffixes' which cause duplicate columns {'last_update_x'} in the result is deprecated and will raise a MergeError in a future version.
  fact_table = pd.merge(payment, rental[rentalColumns], on='rental_id', how='left').merge(customer, on='customer_id', how='left', suffixes=('', '_customer')).merge(address, on='address_id').merge(store['store_id'], on='store_id').merge(inventory, on='inventory_id', how='left').merge(film, on='film_id', how='left')[['rental_id', 'customer_id', 'staff_id', 'film_id', 'inventory_id', 'address_id', 'rental_id','store_id_x', 'amount']]

In [18]:
fact_table.rename(columns={'store_id_x':'store_id'})

,rental_id,customer_id,staff_id,film_id,inventory_id,address_id,rental_id,store_id,amount
0,1520,341,2,749,3419,346,1520,1,7.99
1,1778,341,1,552,2512,346,1778,1,1.99
2,1849,341,1,551,2507,346,1849,1,7.99
3,2829,341,2,445,2047,346,2829,1,2.99
4,3130,341,2,563,2569,346,3130,1,7.99
...,...,...,...,...,...,...,...,...,...
14591,7071,61,2,951,4361,65,7071,2,1.99
14592,8029,61,2,930,4273,65,8029,2,6.99
14593,8075,61,2,469,2175,65,8075,2,4.99
14594,8651,61,1,454,2095,65,8651,2,3.99
14595,9597,61,2,730,3317,65,9597,2,6.99

In [26]:
fact_table[fact_table['film_id'] == 730]['amount'].sum()

110.71999999999997

In [35]:
groubedByFilmId = fact_table[['film_id', 'amount']].groupby('film_id', as_index=False).sum()
groubedByFilmId[groubedByFilmId['film_id'] == 730]

     film_id  amount
697      730  110.72